Revit 2017 API
StructuralSectionsServiceData Constructor
 Constructs a new instance of SectionTypeParameterServiceData.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public StructuralSectionsServiceData(
	Document document,
	IList<ElementId> currentElementIds
)
Visual Basic
Public Sub New ( _
	document As Document, _
	currentElementIds As IList(Of ElementId) _
)
Visual C++
public:
StructuralSectionsServiceData(
	Document^ document,
	IList<ElementId^>^ currentElementIds
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The current document.
currentElementIds
Type: System.Collections.Generic.IList<ElementId>
 The Ids of the current elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
StructuralSectionsServiceData Class
Autodesk.Revit.DB.Structure Namespace